OpenFoam2/ParaviewTest/circular-cylinderA/system/probes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes out values of fields from cells nearest to specified locations.

\*---------------------------------------------------------------------------*/

#includeEtc "caseDicts/postProcessing/probes/probes.cfg"

fields (p U);
probeLocations
(
   // each entry is a separate probe 
   // make sure to change (x1 y1 z1) and (x2 y2 z2) to
   // the probe coordinates

(0.459627 0.385673 0)
(0.454142 0.392116 0)
(0.448566 0.398482 0)
(0.442902 0.404769 0)
(0.437149 0.410975 0)
(0.431310 0.417099 0)
(0.425385 0.423141 0)
(0.419375 0.429098 0)
(0.413281 0.434970 0)
(0.407106 0.440755 0)
(0.400849 0.446453 0)
(0.394513 0.452062 0)
(0.388098 0.457580 0)
(0.381606 0.463008 0)
(0.375038 0.468344 0)
(0.368396 0.473587 0)
(0.361680 0.478735 0)
(0.354892 0.483789 0)
(0.348034 0.488746 0)
(0.341107 0.493605 0)
(0.334111 0.498367 0)
(0.327050 0.503029 0)
(0.319923 0.507592 0)
(0.312732 0.512053 0)
(0.305479 0.516413 0)
(0.298166 0.520670 0)
(0.290793 0.524823 0)
(0.283363 0.528872 0)
(0.275876 0.532816 0)
(0.268334 0.536653 0)
(0.260739 0.540384 0)
(0.253092 0.544008 0)
(0.245394 0.547523 0)
(0.237648 0.550930 0)
(0.229854 0.554226 0)
(0.222015 0.557413 0)
(0.214132 0.560489 0)
(0.206206 0.563453 0)
(0.198239 0.566305 0)
(0.190232 0.569045 0)
(0.182188 0.571671 0)
(0.174108 0.574183 0)
(0.165992 0.576582 0)
(0.157844 0.578865 0)
(0.149665 0.581034 0)
(0.141455 0.583087 0)
(0.133218 0.585024 0)
(0.124954 0.586845 0)
(0.116665 0.588548 0)
(0.108353 0.590135 0)
(0.100020 0.591605 0)
(0.091666 0.592956 0)
(0.083294 0.594190 0)
(0.074906 0.595306 0)
(0.066503 0.596303 0)
(0.058087 0.597182 0)
(0.049659 0.597941 0)
(0.041221 0.598582 0)
(0.032775 0.599104 0)
(0.024322 0.599507 0)
(0.015865 0.599790 0)
(0.007404 0.599954 0)
(-0.001058 0.599999 0)
(-0.009520 0.599924 0)
(-0.017979 0.599731 0)
(-0.026436 0.599417 0)
(-0.034887 0.598985 0)
(-0.043331 0.598433 0)
(-0.051767 0.597763 0)
(-0.060192 0.596973 0)
(-0.068605 0.596065 0)
(-0.077005 0.595038 0)
(-0.085389 0.593893 0)
(-0.093756 0.592630 0)
(-0.102105 0.591248 0)
(-0.110433 0.589750 0)
(-0.118740 0.588133 0)
(-0.127022 0.586400 0)
(-0.135280 0.584551 0)
(-0.143510 0.582585 0)
(-0.151712 0.580503 0)
(-0.159884 0.578305 0)
(-0.168024 0.575993 0)
(-0.176131 0.573566 0)
(-0.184203 0.571025 0)
(-0.192238 0.568370 0)
(-0.200234 0.565603 0)
(-0.208191 0.562722 0)
(-0.216107 0.559730 0)
(-0.223979 0.556627 0)
(-0.231807 0.553413 0)
(-0.239589 0.550088 0)
(-0.247323 0.546655 0)
(-0.255008 0.543112 0)
(-0.262642 0.539462 0)
(-0.270224 0.535704 0)
(-0.277753 0.531840 0)
(-0.285226 0.527870 0)
(-0.292642 0.523795 0)
(-0.300000 0.519615 0)

);

// ************************************************************************* //
